# read design
read -sv ../../rtl/lfsr_galois_p.sv
hierarchy -top lfsr_galois_p

# the high-level stuff
proc; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to vsclib013.lib
dfflibmap -liberty ../../../common/lib/vsclib013.lib

# mapping logic to vsclib013.lib
abc -liberty ../../../common/lib/vsclib013.lib

# cleanup
clean

# write the verilog file
write_verilog lfsr_galois_p_synth.v

stat

show
